---
kind: type
id: T:Autodesk.Revit.DB.FramingShapeClassification
source: html/4f5071f8-2c67-fbb7-b684-dd28dd0173f2.htm
---
# Autodesk.Revit.DB.FramingShapeClassification

This enumeration is used to classify MEP Ancillary Framing shape.

## Syntax (C#)
```csharp
public enum FramingShapeClassification
```